{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"stateful": false, "unroll": false, "go_backwards": false, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "implementation": 0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 6, 1], "units": 32, "return_sequences": false, "dropout": 0.0, "activation": "tanh", "dtype": "float32", "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "gru_1", "use_bias": true}, "class_name": "GRU"}, {"config": {"kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential"}