{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "hard_tanh", "kernel_constraint": null, "batch_input_shape": [null, 6, 1], "dtype": "float32", "kernel_regularizer": null, "units": 32, "unroll": false, "use_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "implementation": 0, "trainable": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "gru_44", "bias_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "stateful": false}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "name": "dense_88", "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true}}], "keras_version": "2.0.2"}