{"keras_version": "2.0.2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_sequences": false, "batch_input_shape": [null, 6, 1], "use_bias": true, "unroll": false, "bias_regularizer": null, "kernel_constraint": null, "units": 32, "dtype": "float32", "unit_forget_bias": true, "activation": "hard_tanh", "recurrent_dropout": 0.0, "kernel_regularizer": null, "trainable": true, "go_backwards": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_3", "implementation": 0, "stateful": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_5", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 1, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}